bettervision/controllers/SensorController.php

SELECT * FROM `sensor` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Sensor::findOne(['id' => $id])) !== null) {